# FamilyWindowInsetParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FamilyWindowInsetParam Property
ParameterTypeId Class See Also
---
"Inset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FamilyWindowInsetParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyWindowInsetParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FamilyWindowInsetParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace